---
kind: other
id: Methods.T:Autodesk.Revit.DB.RevisionSettings
source: html/4279cf08-35cf-2e38-52a7-4f354618032e.htm
---
# RevisionSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.